src/test/java/flexshopper/com/resources/testDataResources/xmlFiles/CreditCardSaleManual.xml

<soap:Envelope
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <PosRequest
                clientType="string"
                clientVer="string"
                xmlns="http://Hps.Exchange.PosGateway">
            <Ver1.0>
                <Header>
                    <SecretAPIKey>skapi_cert_MXJDAgDFDgAAG6p2klfH53YVghOLZekzRB4C1AjqHw</SecretAPIKey>
                    <PosReqDT>2022-02-18T11:26:48.296Z</PosReqDT>
                </Header>
                <Transaction>
                    <CreditSale>
                        <Block1>
                            <CardData>
                                <ManualEntry>
                                    <CardNbr>4111111111111111<CardNbr>
                                    <ExpMonth>06<ExpMonth>
                                    <ExpYear>2022<ExpYear>
                                    <ReaderPresent>Y</ReaderPresent>
                                </ManualEntry>
                                <TokenParameters>
                                    <Mapping>CONSTANT</Mapping>
                                </TokenParameters>
                            </CardData>
                            <Amt>11.00</Amt>
                            <AllowDup>Y</AllowDup>
                            <AllowPartialAuth>Y</AllowPartialAuth>
                            <hps:CPCData>
                                <hps:TaxType>NOTUSED</hps:TaxType>
                            </hps:CPCData>
                        </Block1>
                    </CreditSale>
                </Transaction>
            </Ver1.0>
        </PosRequest>
    </soap:Body>
</soap:Envelope>